Revit 2026 API

# BuiltInFailuresLevelFailures Class

---

Failures about Level.

SystemObject Autodesk.Revit.DBBuiltInFailuresLevelFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class LevelFailures
```
```vb
Public NotInheritable Class LevelFailures
```
```cpp
public ref class LevelFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type LevelFailures = class end
```

The BuiltInFailuresLevelFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | NoLevelsLeft | There are no levels or plan views remaining in the project. |
|  | NoLevelsLeftReloading | As a result of Reloading Latest, there are no Levels left. Create a new Level, and then Reload Latest again. |
|  | StoryAboveDeleted | The level set as the Story Above for these levels is being deleted. This change will cause these levels to revert to the default Story Above. |
|  | StoryAboveMoved | The level set as the Story Above for these levels has moved below these levels. This change will cause these levels to revert to the default Story Above. |
|  | StoryAboveNonStoryLevel | The level set as the Story Above for these levels is no longer a story level. This change will cause these levels to revert to the default Story Above. |

#### Reference

Autodesk.Revit.DB Namespace